Repository: Yigoya/home_service_app
Catalog: lib/l10n/app_*.arb
Languages: am

source: Our Best Technicians
am: የእኛ ምርጥ ቴክኒሻኖች

source: What the Customer Says
am: ደንበኛው ምን ይላል

source: Hello
am: ሰላም

source: Guest
am: እንግዳ

# everythingAtYourFingertips
source: All in one services, on demand
am: ሁሉም አገልግሎቶች በአንድ ላይ፣ በፈለጉበት ጊዜ

source: Search for services
am: አገልግሎቶችን ፈልግ

source: Location
am: ቦታ

source: Rating
am: ደረጃ

source: View Profile
am: መገለጫ ይመልከቱ

source: Please Select Date and Time
am: እባክዎ ቀን እና ሰዓት ይምረጡ

source: Back
am: ተመለስ

source: Submit
am: አስገባ

source: Next
am: ቀጣይ

# selectSchedulingDateAndTime
source: Select a Scheduling Date and Time
am: የመርሃ ግብር ቀን እና ሰዓት ይምረጡ

source: Date
am: ቀን

source: Choose Date
am: ቀን ይምረጡ

source: Time
am: ሰዓት

source: Choose Time
am: ሰዓት ይምረጡ

source: Selected
am: ተመርጧል

source: Enter your answer here
am: መልስዎን እዚህ ያስገቡ

source: Search by name
am: በስም ፈልግ

source: Select your sub-city
am: ክፍለ ከተማዎን ይምረጡ

source: Select your wereda
am: ወረዳዎን ይምረጡ

source: Apply Filters
am: ማጣሪያዎችን ይተግብሩ

source: Select and continue
am: ይምረጡ እና ይቀጥሉ

# pleaseSelectSubCity
source: Please select a sub-city
am: እባክዎ ክፍለ ከተማ ይምረጡ

# pleaseSelectWereda
source: Please select a wereda
am: እባክዎ ወረዳ ይምረጡ

# pleaseDescribeJob
source: Please describe the job
am: እባክዎ ስራውን ይግለጹ

# describeJobTask
source: Explain the job task in simple language
am: ስራውን በቀላል ቋንቋ ይግለጹ

# bookService
source: Book the Service
am: አገልግሎቱን ይያዙ

source: Booking Confirmed
am: ቦታ ማስያዝ ተረጋግጧል

# bookingSuccess
source: Your booking has been successfully placed.
am: ቦታ ማስያዝዎ በተሳካ ሁኔታ ተጠናቅቋል።

source: Pending
am: በጥበቃ ላይ

source: Accepted
am: ተቀባይነት አግኝቷል

source: Accept
am: ተቀበል

source: Started
am: ጀመረ

source: Completed
am: ተጠናቋል

source: Denied
am: ተቀባይነት አላገኘም

source: Declined
am: ተቀባይነት አላገኘም

source: Edit Name
am: ስም አርትዕ

source: Enter your name
am: ስምዎን ያስገቡ

source: Cancel
am: ይቅር

source: Save
am: አስቀምጥ

source: Complete
am: ጨርስ

source: Dispute
am: ክርክር

source: Edit
am: አርትዕ

source: Your Rating
am: ደረጃ መስጠት

source: Rate and Review
am: ደረጃ እና አስተያየት ይስጡ

# writeYourReview
source: Write your review here
am: አስተያየትዎን እዚህ ይጻፉ

# pleaseProvideRatingAndReview
source: Please provide a rating and review
am: እባክዎ ደረጃ እና አስተያየት ይስጡ

source: Submit Review
am: አስተያየት አስገባ

source: Give Review
am: አስተያየት ይስጡ

source: Business Hour
am: የስራ ሰዓት

source: Monday
am: ሰኞ

source: Tuesday
am: ማክሰኞ

source: Wednesday
am: እሮብ

source: Thursday
am: ሐሙስ

source: Friday
am: አርብ

source: Saturday
am: ቅዳሜ

source: Sunday
am: እሁድ

source: No schedule available
am: ምንም የመርሃ ግብር የለም

source: Ratings for
am: ደረጃ ለ

# noOneRatedYet
source: No one has rated yet
am: ማንም እስካሁን ደረጃ አላስገባም

source: Bookings
am: ቦታ ማስያዝ

source: More about
am: ተጨማሪ መረጃ

source: Schedule saved
am: የመርሃ ግብር ተቀምጧል

source: My Schedule
am: የእኔ መርሃ ግብር

source: Contact us
am: አግኙን

source: Enter your email
am: ኢሜልዎን ያስገቡ

source: Phone Number
am: ስልክ ቁጥር

source: Enter your phone number
am: ስልክ ቁጥርዎን ያስገቡ

source: Message
am: መልእክት

source: Write your message
am: መልእክትዎን ይጻፉ

source: Enter your reason
am: ምክንያትዎን ያስገቡ

source: State your dispute
am: ክርክርዎን ይግለጹ

source: Describe your dispute
am: ክርክርዎን ይግለጹ

source: Close
am: ዝጋ

source: Notifications
am: ማሳወቂያዎች

source: Welcome Back!
am: እንኳን ደህና መጡ!

# loginToYourAccount
source: Please login to your account
am: እባክዎ ወደ አካውንትዎ ይግቡ

source: Enter your password
am: የይለፍ ቃልዎን ያስገቡ

source: Forgot Password?
am: የይለፍ ቃል ረሳኽው?

source: Or Sign In With
am: ወይም በዚህ ይግቡ

# dontHaveAccount
source: Don't you have an account?
am: አካውንት የሎትም?

# registerAsTechnician
source: Register as a Technician
am: እንደ ቴክኒሻን ይመዝገቡ

source: Complete Your Details
am: ዝርዝሮችዎን ይሙሉ

# validEmailRequired
source: Please enter a valid email
am: እባክዎ ትክክለኛ ኢሜል ያስገቡ

# validPhoneRequired
source: Please enter your phone number
am: እባክዎ ስልክ ቁጥርዎን ያስገቡ

# createAccount
source: Create your account
am: አካውንት ይፍጠሩ

# joinUs
source: Join us to experience the best home services.
am: ምርጥ የቤት አገልግሎቶችን ለመለማመድ ከእኛ ጋር ይቀላቀሉ።

source: Sign Up
am: ይመዝገቡ

source: Technician Registration
am: የቴክኒሻን ምዝገባ

# fillDetailsToRegister
source: Please fill in the details below to register as a technician.
am: እንደ ቴክኒሻን ለመመዝገብ ከታች ያሉትን ዝርዝሮች ይሙሉ።

# enterYourBio
source: Please enter your bio
am: እባክዎ ባዮዎን ያስገቡ

# almostThere
source: You are almost there!
am: በጣም ቅርብ ነዎት!

source: Services
am: አገልግሎቶች

source: DOCUMENTS
am: ሰነዶች

source: ID Card
am: የመለያ ካርድ

source: Confirm Password
am: የይለፍ ቃል ያረጋግጡ

source: Upload
am: ጫን

source: Enter Token
am: ቶክን ያስገቡ

# tokenPlaceholder
source: Enter your token here
am: ቶክንዎን እዚህ ያስገቡ

source: Token
am: ቶክን

source: Token cannot be empty
am: ቶክን ባዶ ሊሆን አይችልም

# tokenTooShort
source: Token must be at least 16 characters long
am: ቶክን ቢያንስ 16 ቁምፊ ሊሆን ይገባል

# invalidToken
source: Please enter a valid token.
am: እባክዎ ትክክለኛ ቶክን ያስገቡ።

source: Token not found.
am: ቶክን አልተገኘም።

source: Ticket uploaded successfully!
am: ቲኬት በተሳካ ሁኔታ ተጫኗል!

source: Failed to upload ticket.
am: ቲኬት ማስገባት አልተሳካም።

source: Technician Details
am: የቴክኒሻን ዝርዝሮች

source: Bio
am: ባዮ

source: Phone
am: ስልክ

source: Availability
am: መገኘት

source: Upload Ticket
am: ቲኬት ጫን

source: Submit Ticket
am: ቲኬት አስገባ

# registrationFeeTransfer
source: Registration Fee Transfer 500 birr
am: የምዝገባ ክፍያ ማስተላለፍ 500 ብር

source: Upload image
am: ምስል ጫን

source: Verification in Progress
am: ማረጋገጫ በሂደት ላይ ነው

# verificationMessage
source: Thank you for your patience. We are currently verifying your account.
am: ለትዕግስትዎ እናመሰግናለን። አካውንትዎን እየማረጋገጥ ነው።

# accountActivated
source: Your account has been successfully activated. You can now log in and start using the app.
am: አካውንትዎ በተሳካ ሁኔታ ተገቢ ሆኗል። አሁን ለመግባት እና መተግበሪያውን መጠቀም ይችላሉ።

# waitingForApproval
source: Waiting for Your Approval
am: ለፀደቀ በጥበቃ ላይ

# requestProcessing
source: Your request is being processed. You will be notified once it has been approved.
am: ጥያቄዎ እየተካሄደ ነው። አንዴ በፀደቀ ጊዜ ይታወቃል።

source: Refresh Status
am: ሁኔታ ያድስ

source: Home Service Platform
am: የቤት አገልግሎት መድረክ

source: TECHNICIAN
am: ቴክኒሻን

source: email
am: ኢሜል

source: password
am: የይለፍ ቃል

source: booking
am: ቦታ ማስያዝ

source: No date provided.
am: ምንም ቀን አልተሰጠም።

source: Invalid date format.
am: የተሳሳተ ቀን ቅርጸት።

# dateHasPassed
source: The date has already passed.
am: ቀኑ አልፎታል።

# lessThanMinuteRemaining
source: Less than a minute remaining
am: ከአንድ ደቂቃ ያነሰ ቀርቷል

# locationServicesDisabled
source: Location services are disabled. Please enable them in settings.
am: የቦታ አገልግሎቶች ተሰናክለዋል። እባክዎ በማስተካከያዎች ውስጥ ያንቁት።

# locationPermissionDenied
source: Location permission denied. Please grant permission to access location.
am: የቦታ ፈቃድ ተቀባይነት አላገኘም። እባክዎ ፈቃድ ይስጡ።

# locationPermissionPermanentlyDenied
source: Location permission is permanently denied. Please enable it in settings.
am: የቦታ ፈቃድ ለዘላቂ ተቀባይነት አላገኘም። እባክዎ በማስተካከያዎች ውስጥ ያንቁት።

# unableToFetchAddress
source: Unable to fetch address for the current location.
am: የአሁኑ ቦታ አድራሻ ማግኘት አልተቻለም።

source: error
am: ስህተት

# errorFetchingLocation
source: An error occurred while fetching the location
am: ቦታ ሲገኝ ስህተት ተከስቷል

# networkIssue
source: Network issue occurred.
am: የኔትወርክ ችግር ተከስቷል።

source: Network Error:
am: የኔትወርክ ስህተት:

# serverError
source: Server error occurred.
am: የሰርቨር ስህተት ተከስቷል።

# serverErrorMessage
source: Server Error:
am: የሰርቨር ስህተት:

source: Invalid input.
am: የተሳሳተ ግቤት።

source: Validation Error:
am: የማረጋገጫ ስህተት:

# unknownError
source: An unknown error occurred.
am: ያልታወቀ ስህተት ተከስቷል።

# errorMessage
source: Error:
am: ስህተት:

# submittingContactForm
source: Submitting Contact Form with data:
am: የአግኙን ቅጽ በመረጃ ማስገባት:

# formSubmittedSuccessfully
source: Your form has been submitted successfully.
am: ቅጽዎ በተሳካ ሁኔታ ተላልፏል።

source: Network Error happened
am: የኔትወርክ ስህተት ተከስቷል

# submittingDisputeForm
source: Submitting Dispute Form with data:
am: የክርክር ቅጽ በመረጃ ማስገባት:

source: Signed up successfully
am: በተሳካ ሁኔታ ተመዝግበዋል

source: Login failed
am: መግቢያ አልተሳካም

source: Error occurred
am: ስህተት ተከስቷል

source: Logged in successfully
am: በተሳካ ሁኔታ ገብተዋል

# tanahAirServices
source: What services does TanahAir Offer?
am: TanahAir ምን አይነት አገልግሎቶችን ይሰጣል?

# tanahAirServiceDescription
source: TanahAir offers a service for creating website design, illustration, icon set, and more.
am: TanahAir የድር ጣቢያ ንድፍ፣ ስዕል፣ አዶ ስብስብ እና ሌሎችንም ለመፍጠር አገልግሎት ይሰጣል።

# whyChooseTanahAir
source: Why should I choose a Design studio like TanahAir?
am: እንደ TanahAir ያለ ዲዛይን ስቱዲዮ ለምን ምረጥ?

# tanahAirAdvantage
source: TanahAir provides the best service and solves customer problems with flexibility.
am: TanahAir ምርጥ አገልግሎት ይሰጣል እና የደንበኞችን ችግሮች በግልፅ ይፈታል።

# howTanahAirCreatesContent
source: How does TanahAir create website content without knowing our Business plan?
am: TanahAir የድር ጣቢያ ይዘትን ያለ የንግድ እቅዳችን እንዴት ይፈጥራል?

# tanahAirCollaboration
source: We use collaborative tools and processes to align with the clientâ€™s vision.
am: ከደንበኞች ራዕይ ጋር ለመስማማት የጋራ መሳሪያዎችን እና ሂደቶችን እንጠቀማለን።

source: Discover New Features
am: አዳዲስ ባህሪያትን ይፈልጉ

# exploreInnovativeTools
source: Explore innovative tools designed to enhance your productivity
am: የምርታማነትዎን ለማሳደግ የተነደፉ የፈጠራ መሳሪያዎችን ያስሱ

source: Smart Analytics
am: ስማርት ትንታኔ

# realTimeInsights
source: Real-time insights and data visualization for informed decisions
am: በጊዜ ውስጥ ግንዛቤዎች እና የውሂብ ማሳያ

# secureAndPrivate
source: Secure & Private
am: ደህንነት እና ግላዊነት

# enterpriseGradeSecurity
source: Enterprise-grade security protecting your data 24/7
am: የድርጅት ደረጃ ደህንነት ውሂብዎን 24/7 ይጠብቃል

source: Skip
am: ዝለል

source: Get Started
am: ጀምር

source: Start Time
am: የመጀመሪያ ሰዓት

source: End Time
am: የመጨረሻ ሰዓት

# enterYourPhoneNumberPrompt
source: Enter your phone number
am: ስልክ ቁጥርዎን ያስገቡ

source: All fields must be filled
am: ሁሉም መስኮች መሞላት አለባቸው

source: Profile updated successfully
am: መገለጫ በተሳካ ሁኔታ ተዘምኗል

source: Save All Changes
am: ሁሉንም ለውጦች አስቀምጥ

source: Name
am: ስም

# enterYourNamePrompt
source: Enter your name
am: ስምዎን ያስገቡ

source: Name is required
am: ስም ያስፈልጋል

source: Email is required
am: ኢሜል ያስፈልጋል

source: Phone number is required
am: ስልክ ቁጥር ያስፈልጋል

# writeYourMessagePrompt
source: Write your message
am: መልእክትዎን ይጻፉ

source: Please put your message
am: እባክዎ መልእክትዎን ያስገቡ

# notificationsSection
source: Notifications
am: ማሳወቂያዎች

source: Mark All As Read
am: ሁሉንም እንደተነበቡ ምልክት ያድርጉ

# noNotifications
source: You have no notifications
am: ምንም ማሳወቂያዎች የሉዎትም

source: View Details
am: ዝርዝሮችን ይመልከቱ

source: Entity Details
am: የአንታይቲ ዝርዝሮች

source: Reason
am: ምክንያት

source: Please enter your reason
am: እባክዎ ምክንያትዎን ያስገቡ

# stateYourDisputePrompt
source: State your dispute
am: ክርክርዎን ይግለጹ

# describeYourDisputePrompt
source: Describe your dispute
am: ክርክርዎን ይግለጹ

source: Please describe your issue
am: እባክዎ ችግርዎን ይግለጹ

source: Customer Information
am: የደንበኛ መረጃ

source: Become a Technician
am: ቴክኒሻን ይሁኑ

# loginSection
source: Login
am: መግቢያ

source: About Me
am: ስለ እኔ

source: Saved Address
am: የተቀመጠ አድራሻ

source: Account Setting
am: የአካውንት ማስተካከያ

source: Payment Methods
am: የክፍያ ዘዴዎች

source: Free Credit
am: ነፃ ክሬዲት

source: Online Chat
am: ኦንላይን ውይይት

source: Help Center
am: የእርዳታ ማዕከል

source: Log Out
am: ውጣ

source: Login Required
am: መግቢያ ያስፈልጋል

# pleaseLoginFirst
source: Please login first to access this feature.
am: እባክዎ መጀመሪያ ይግቡ ይህን ባህሪ ለመጠቀም

source: Coming Soon
am: በቅርቡ ይመጣል

# featureComingSoon
source: This feature is coming soon!
am: ይህ ባህሪ በቅርቡ ይመጣል!

# workingHardForFeature
source: We are working hard to bring you this feature. Stay tuned for updates!
am: ይህን ባህሪ ለማምጣት እየተከታተልን ነው። ለማዘመን ይጠብቁን!

source: Go Back
am: ተመለስ

# whatIsTaskLocation
source: What is the task location
am: የስራው ቦታ ምንድነው

# conti
source: Continue
am: ቀጥል

# bookServicePrompt
source: Book Service
am: አገልግሎት ይያዙ

source: No Name
am: ስም የለም

source: FAQ
am: ተደጋግሞ የሚነሱ ጥያቄዎች

source: No Technicians Found
am: ምንም ቴክኒሻኖች አልተገኙም

source: No Reviews Yet
am: ምንም አስተያየቶች የሉም

source: Current Location
am: የአሁኑ ቦታ

source: We are here to serve you
am: እዚህ ላይ እንድንገለግልዎ ነው

source: Service Not Found
am: አገልግሎት አልተገኘም

source: See Less
am: በትንሹ ይመልከቱ

source: See More
am: ተጨማሪ ይመልከቱ

# servicesSection
source: Services
am: አገልግሎቶች

source: subcity
am: ክፍለ ከተማ

source: wereda
am: ወረዳ

source: What would you like to do?
am: ምን ማድረግ ይፈልጋሉ?

# registerAsCustomer
source: Register as a Customer
am: እንደ ደንበኛ ይመዝገቡ

# registerAsTechnicianPrompt
source: Register as a Technician
am: እንደ ቴክኒሻን ይመዝገቡ

source: terms of service
am: የአገልግሎት ውል

source: privacy policy
am: የግላዊነት ፖሊሲ

source: Sign In
am: ይግቡ

# registerPrompt
source: Register
am: ይመዝገቡ

source: You need to login first
am: መጀመሪያ መግባት ያስፈልግዎታል

# pleaseLoginFirstToViewDetails
source: Please login first to be able to view more details
am: እባክዎ መጀመሪያ ይግቡ ተጨማሪ ዝርዝሮችን ለማየት

# myScheduleSection
source: My Schedule
am: የእኔ መርሃ ግብር

# homeSection
source: Home
am: ቤት

# settingsSection
source: Settings
am: ማስተካከያዎች

source: No bio available
am: ምንም ባዮ የለም

source: See my Schedule
am: የእኔ መርሃ ግብር ይመልከቱ

# rateAndReviewPrompt
source: Rate and Review
am: ደረጃ እና አስተያየት ይስጡ

source: Write your review here
am: አስተያየትዎን እዚህ ይጻፉ

# pleaseProvideRatingAndReviewPrompt
source: Please provide a rating and review
am: እባክዎ ደረጃ እና አስተያየት ይስጡ

# submitReviewPrompt
source: Submit Review
am: አስተያየት አስገባ

# paymentSection
source: Payment
am: ክፍያ

source: Amount
am: መጠን

source: Please enter the amount
am: እባክዎ መጠኑን ያስገቡ

source: Please enter your email
am: እባክዎ ኢሜልዎን ያስገቡ

source: First Name
am: የመጀመሪያ ስም

source: Please enter your first name
am: እባክዎ የእርስዎን የመጀመሪያ ስም ያስገቡ

source: Last Name
am: የአባት ስም

source: Please enter your last name
am: እባክዎ የእርስዎን የአያት ስም ያስገቡ

source: Select Bank
am: ባንክ ይምረጡ

source: Please select a bank
am: እባክዎ ባንክ ይምረጡ

source: Account Number
am: የሂሳብ ቁጥር

source: Please enter your account number
am: እባክዎ የሂሳብ ቁጥርዎን ያስገቡ

source: Could not launch payment page
am: የክፍያ ገጹን ማስጀመር አልተቻለም

source: Failed to initialize payment
am: ክፍያን ለመጀመር አልተቻለም

# verificationTokenRequired
source: Verification token is required!
am: የማረጋገጫ ቶከን ያስፈልጋል!

source: Passwords do not match!
am: የይለፍ ቃላት አይዛመዱም!

# passwordMustBeAtLeast6Characters
source: Password must be at least 6 characters long!
am: የይለፍ ቃል ቢያንስ 6 ቁምፊዎች ሊኖሩት ይገባል!

# enterYourEmailPrompt
source: Enter Your Email
am: ኢሜልዎን ያስገቡ

# sendVerificationToken
source: We'll send you a verification token to reset your password.
am: የይለፍ ቃልዎን ለመቀየር የማረጋገጫ ቶከን እንልካለን።

source: Send Token
am: ቶከን ላክ

source: Set New Password
am: አዲስ የይለፍ ቃል ያዘጋጁ

# enterStrongPassword
source: Enter a strong password and confirm it below.
am: ጠንካራ የይለፍ ቃል ያስገቡ እና ከታች ያረጋግጡት።

# verificationTokenFromEmail
source: Verification token from your email
am: ከኢሜልዎ የመጣ የማረጋገጫ ቶከን

source: New Password
am: አዲስ የይለፍ ቃል

# confirmPasswordPrompt
source: Confirm Password
am: የይለፍ ቃል ያረጋግጡ

source: Reset Password
am: የይለፍ ቃል ዳግም ያዘጋጁ

# backPrompt
source: Back
am: ተመለስ

# technicianIdMissing
source: Technician ID is missing
am: የቴክኒሻን መለያ ጠፍቷል

# accountActivatedMessage
source: Your account has been successfully activated. You can now log in and start using the app.
am: መለያዎ በተሳካ ሁኔታ ተግቶበታል። አሁን ለመግባት እና መተግበሪያውን መጠቀም ይችላሉ።

# logInPrompt
source: Log In
am: ግባ

source: Waiting for Your Approval
am: ለፍቃድዎ በጥበቃ ላይ

# requestBeingProcessed
source: Your request is being processed. You will be notified once it has been approved.
am: ጥያቄዎ እየተካሄደ ነው። ከተፈቀደ በኋላ ይታወቃል።

# refreshStatusPrompt
source: Refresh Status
am: ሁኔታ ያድስ

# verificationInProgressMessage
source: Thank you for your patience. We are currently verifying your account.
am: ለትዕግስትዎ እናመሰግናለን። መለያዎን እየማረጋገጥ ነን።

# weWillContactYou
source: We will contact you once your verification is complete.
am: ማረጋገጫው ከተጠናቀቀ በኋላ እንገናኝዎታለን።

# completeYourDetailsPrompt
source: Complete Your Details
am: ዝርዝሮችዎን ያጠናቅቁ

source: Please enter your name
am: እባክዎ ስምዎን ያስገቡ

source: Please enter a valid email
am: እባክዎ ትክክለኛ ኢሜል ያስገቡ

source: Please enter your phone number
am: እባክዎ ስልክ ቁጥርዎን ያስገቡ

# submitPrompt
source: Submit
am: ላክ

source: Open Mail App
am: የኢሜል መተግበሪያ ክፈት

source: No mail apps installed
am: የኢሜል መተግበሪያ አልተጫነም

source: OK
am: እሺ

source: Verify Your Email
am: ኢሜልዎን ያረጋግጡ

# verifyEmailMessage
source: To continue, please verify your email by clicking the link we sent to your inbox.
am: ለመቀጠል፣ ወደ ኢሜልዎ የላክንበት አገናኝ በመጫን ኢሜልዎን ያረጋግጡ።

source: Open Gmail
am: ጂሜል ክፈት

source: Resend email feature coming soon!
am: ኢሜል እንደገና ለመላክ ባህሪ በቅርቡ ይመጣል!

# didntReceiveEmail
source: Didn't receive the email? Resend
am: ኢሜል አልደረሰዎትም? እንደገና ላክ

# registrationFeeTransferMessage
source: For registration fee transfer 500 birr
am: ለምዝገባ ክፍያ ማስተላለፍ 500 ብር

# uploadImagePrompt
source: Upload image
am: ምስል ጫን

source: Booking Saved
am: ቦታ ተቀምጧል

source: Edit Booking
am: ቦታ አርም

source: Scheduled Date
am: የታቀደ ቀን

source: Please select a date
am: እባክዎ ቀን ይምረጡ

source: Please enter a country
am: እባክዎ ሀገር ያስገቡ

source: Save Booking
am: ቦታ አስቀምጥ

source: coins
am: ሳንቲሞች

source: Purchase Successful
am: ግዢ ተሳክቷል

source: You have purchased
am: የገዛኸው

source: Chat
am: ቻት

source: Enter your message...
am: መልእክትዎን ያስገቡ...

source: Addis Ababa
am: አዲስ አበባ

source: Sign in with Google
am: በጉግል ይግቡ

source: Have an account
am: አካውንት አለዎት

source: Language
am: ቋንቋ

source: Email or Phone number
am: ኢሜል ወይም ስልክ ቁጥር

source: Select Services
am: አገልግሎቶችን ይምረጡ

source: or
am: ወይም

source: Profile Image
am: የመገለጫ ምስል

source: Tell us about yourself
am: ስለ ራስዎ ይንገሩን
